bench/scenarios/soak.yaml
_comment: "Soak scenario - capture plane only (channel PRE-CREATED by the runner).\n\n  npx artillery run --output bench/results/soak-raw.json bench/scenarios/soak.yaml\n\nShape: 120s sustained at 400 req/s with github-push-sized (~11.5 KB, matching\nbench/payloads/github-push.json at 11,530 B) bodies posted to\n/c/bench-capture/soak. Tests memory stability under sustained large-body load:\n48,000 captures x ~11.5 KB ~= 553 MB of raw body bytes ingested over 2 minutes.\n\nRate-limit headroom: 400 req/s against burst 50,000 / refill 50,000 per s is\nfar below the refill rate - no 429s expected.\n\nExpected RSS behavior (runner samples VmRSS externally):\n  - RSS should climb during the first ~10-20s while per-connection buffers,\n    arena pages, and event-store write paths warm up, then PLATEAU for the\n    remainder of the run. Steady-state plateau is pass behavior.\n  - Growth that stays linear through minute 2 (i.e. no plateau by ~90s) is\n    the failure signal: unbounded buffering or per-event allocation never\n    being reclaimed. Compare VmRSS at t=30s vs t=110s: delta should be\n    small (< ~10-20%) once warmed.\n  - p99 relaxed to 500 ms vs spike's 250 ms: 11.5 KB bodies cost more in\n    read/parse/store than stripe-sized ones."
config:
  target: http://127.0.0.1:8001
  phases:
  - name: soak-sustained
    duration: 120
    arrivalRate: 400
  ensure:
  - http.response_time.p99: 500
  - http.codes.429: 0
  - http.codes.5xx: 0
scenarios:
- name: github-push-sized sustained capture
  flow:
  - post:
      url: /c/bench-capture/soak
      headers:
        content-type: application/json
      body: '{"ref": "refs/heads/main", "before": "7fd1a60b01f91b314f59955a4e4d4e80d8edf11d", "after": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c4", "_seq": "{{ $randomNumber(1, 999999999) }}", "repository": {"id": 186853002, "full_name": "octocat/hello-world", "default_branch": "main", "html_url": "https://github.com/octocat/hello-world", "owner": {"login": "octocat"}}, "pusher": {"name": "octocat"}, "commits": [{"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}, {"id": "b7a1c2ea2b0fc0d9224c8f5152b8dd70f1a2b3c00", "message": "fix(module): handle edge case in signature validation path #100\n\nLonger body explaining the rationale for change, referencing the issue and describing the regression test added for the spike-soak benchmark workload.", "timestamp": "2026-08-21T12:00:00Z", "author": {"name": "octocat", "email": "octocat@example.com"}, "committer": {"name": "octocat", "email": "octocat@example.com"}, "added": ["src/module/validator.rs"], "removed": [], "modified": ["src/module/mod.rs", "tests/module_test.rs"]}]}'